/*
Copyright (c) 2018 gchihiha

This software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.

Permission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:

1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.

2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.

3. This notice may not be removed or altered from any source distribution.

*/

#pragma once
#include "vulkan/vulkan.h"
#include "common.h"
#include <array>
#include "vk_enums.h"
#include "vk_bits.h"
namespace laka { namespace vk {
using S_physical_device_features2_KHR = 
				VkPhysicalDeviceFeatures2KHR;//1

using S_physical_device_properties2_KHR = 
				VkPhysicalDeviceProperties2KHR;//2

using S_format_properties2_KHR = 
				VkFormatProperties2KHR;//3

using S_image_format_properties2_KHR = 
				VkImageFormatProperties2KHR;//4

using S_physical_device_image_format_info2_KHR = 
				VkPhysicalDeviceImageFormatInfo2KHR;//5

using S_queue_family_properties2_KHR = 
				VkQueueFamilyProperties2KHR;//6

using S_physical_device_memory_properties2_KHR = 
				VkPhysicalDeviceMemoryProperties2KHR;//7

using S_sparse_image_format_properties2_KHR = 
				VkSparseImageFormatProperties2KHR;//8

using S_physical_device_sparse_image_format_info2_KHR = 
				VkPhysicalDeviceSparseImageFormatInfo2KHR;//9

using S_physical_device_variable_pointer_features_KHR = 
				VkPhysicalDeviceVariablePointerFeaturesKHR;//10

using S_external_memory_properties_KHR = 
				VkExternalMemoryPropertiesKHR;//11

using S_physical_device_external_image_format_info_KHR = 
				VkPhysicalDeviceExternalImageFormatInfoKHR;//12

using S_external_image_format_properties_KHR = 
				VkExternalImageFormatPropertiesKHR;//13

using S_physical_device_external_buffer_info_KHR = 
				VkPhysicalDeviceExternalBufferInfoKHR;//14

using S_external_buffer_properties_KHR = 
				VkExternalBufferPropertiesKHR;//15

using S_physical_device_id_properties_KHR = 
				VkPhysicalDeviceIDPropertiesKHR;//16

using S_external_memory_image_create_info_KHR = 
				VkExternalMemoryImageCreateInfoKHR;//17

using S_external_memory_buffer_create_info_KHR = 
				VkExternalMemoryBufferCreateInfoKHR;//18

using S_export_memory_allocate_info_KHR = 
				VkExportMemoryAllocateInfoKHR;//19

using S_physical_device_external_semaphore_info_KHR = 
				VkPhysicalDeviceExternalSemaphoreInfoKHR;//20

using S_external_semaphore_properties_KHR = 
				VkExternalSemaphorePropertiesKHR;//21

using S_export_semaphore_create_info_KHR = 
				VkExportSemaphoreCreateInfoKHR;//22

using S_physical_device_external_fence_info_KHR = 
				VkPhysicalDeviceExternalFenceInfoKHR;//23

using S_external_fence_properties_KHR = 
				VkExternalFencePropertiesKHR;//24

using S_export_fence_create_info_KHR = 
				VkExportFenceCreateInfoKHR;//25

using S_physical_device_multiview_features_KHR = 
				VkPhysicalDeviceMultiviewFeaturesKHR;//26

using S_physical_device_multiview_properties_KHR = 
				VkPhysicalDeviceMultiviewPropertiesKHR;//27

using S_render_pass_multiview_create_info_KHR = 
				VkRenderPassMultiviewCreateInfoKHR;//28

using S_physical_device_group_properties_KHR = 
				VkPhysicalDeviceGroupPropertiesKHR;//29

using S_memory_allocate_flags_info_KHR = 
				VkMemoryAllocateFlagsInfoKHR;//30

using S_bind_buffer_memory_info_KHR = 
				VkBindBufferMemoryInfoKHR;//31

using S_bind_buffer_memory_device_group_info_KHR = 
				VkBindBufferMemoryDeviceGroupInfoKHR;//32

using S_bind_image_memory_info_KHR = 
				VkBindImageMemoryInfoKHR;//33

using S_bind_image_memory_device_group_info_KHR = 
				VkBindImageMemoryDeviceGroupInfoKHR;//34

using S_device_group_render_pass_begin_info_KHR = 
				VkDeviceGroupRenderPassBeginInfoKHR;//35

using S_device_group_command_buffer_begin_info_KHR = 
				VkDeviceGroupCommandBufferBeginInfoKHR;//36

using S_device_group_submit_info_KHR = 
				VkDeviceGroupSubmitInfoKHR;//37

using S_device_group_bind_sparse_info_KHR = 
				VkDeviceGroupBindSparseInfoKHR;//38

using S_device_group_device_create_info_KHR = 
				VkDeviceGroupDeviceCreateInfoKHR;//39

using S_descriptor_update_template_entry_KHR = 
				VkDescriptorUpdateTemplateEntryKHR;//40

using S_descriptor_update_template_create_info_KHR = 
				VkDescriptorUpdateTemplateCreateInfoKHR;//41

using S_input_attachment_aspect_reference_KHR = 
				VkInputAttachmentAspectReferenceKHR;//42

using S_render_pass_input_attachment_aspect_create_info_KHR = 
				VkRenderPassInputAttachmentAspectCreateInfoKHR;//43

using S_physical_device_16bit_storage_features_KHR = 
				VkPhysicalDevice16BitStorageFeaturesKHR;//44

using S_buffer_memory_requirements_info2_KHR = 
				VkBufferMemoryRequirementsInfo2KHR;//45

using S_image_memory_requirements_info2_KHR = 
				VkImageMemoryRequirementsInfo2KHR;//46

using S_image_sparse_memory_requirements_info2_KHR = 
				VkImageSparseMemoryRequirementsInfo2KHR;//47

using S_memory_requirements2_KHR = 
				VkMemoryRequirements2KHR;//48

using S_sparse_image_memory_requirements2_KHR = 
				VkSparseImageMemoryRequirements2KHR;//49

using S_physical_device_point_clipping_properties_KHR = 
				VkPhysicalDevicePointClippingPropertiesKHR;//50

using S_memory_dedicated_requirements_KHR = 
				VkMemoryDedicatedRequirementsKHR;//51

using S_memory_dedicated_allocate_info_KHR = 
				VkMemoryDedicatedAllocateInfoKHR;//52

using S_image_view_usage_create_info_KHR = 
				VkImageViewUsageCreateInfoKHR;//53

using S_pipeline_tessellation_domain_origin_state_create_info_KHR = 
				VkPipelineTessellationDomainOriginStateCreateInfoKHR;//54

using S_sampler_ycbcr_conversion_info_KHR = 
				VkSamplerYcbcrConversionInfoKHR;//55

using S_sampler_ycbcr_conversion_create_info_KHR = 
				VkSamplerYcbcrConversionCreateInfoKHR;//56

using S_bind_image_plane_memory_info_KHR = 
				VkBindImagePlaneMemoryInfoKHR;//57

using S_image_plane_memory_requirements_info_KHR = 
				VkImagePlaneMemoryRequirementsInfoKHR;//58

using S_physical_device_sampler_ycbcr_conversion_features_KHR = 
				VkPhysicalDeviceSamplerYcbcrConversionFeaturesKHR;//59

using S_sampler_ycbcr_conversion_image_format_properties_KHR = 
				VkSamplerYcbcrConversionImageFormatPropertiesKHR;//60

using S_physical_device_maintenance3_properties_KHR = 
				VkPhysicalDeviceMaintenance3PropertiesKHR;//61

using S_descriptor_set_layout_support_KHR = 
				VkDescriptorSetLayoutSupportKHR;//62

/*	VkOffset2D:*/
typedef struct S_offset_2d{
	int32_t x;
	int32_t y;
};

/*	VkOffset3D:*/
typedef struct S_offset_3d{
	int32_t x;
	int32_t y;
	int32_t z;
};

/*	VkExtent2D:*/
typedef struct S_extent_2d{
	uint32_t width;
	uint32_t height;
};

/*	VkExtent3D:*/
typedef struct S_extent_3d{
	uint32_t width;
	uint32_t height;
	uint32_t depth;
};

/*	VkViewport:*/
typedef struct S_viewport{
	float x;
	float y;
	float width;
	float height;
	float minDepth;
	float maxDepth;
};

/*	VkRect2D:*/
typedef struct S_rect_2d{
	S_offset_2d offset;
	S_extent_2d extent;
};

/*	VkClearRect:*/
typedef struct S_clear_rect{
	S_rect_2d rect;
	uint32_t baseArrayLayer;
	uint32_t layerCount;
};

/*	VkComponentMapping:*/
typedef struct S_component_mapping{
	E_component_swizzle r;
	E_component_swizzle g;
	E_component_swizzle b;
	E_component_swizzle a;
};

/*	VkExtensionProperties:
returnd only*/
typedef struct S_extension_properties{
/*extension name*/
